package task2_2_3_1;

public class Task2_2_3_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 2. Тема 2. Урок 3. Многопоточность. Synchronised.
                    Задание 1. Опишите своими словами, как вы поняли что такое синхронизация
                    потоков в JAVA, а также, что узнали об операторе Synchronised?

                Решение:\s""");

    }
}
