package task1_4_2_1;

public class Task1_4_2_1 {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 1. Тема 4. Урок 2. Конструкторы
                Задание 1. Что такое конструктор по-умолчанию?\s

            Решение:\s""");
        System.out.println("НАДО ПО УМОЛЧАНИЮ!!! Конструктор - это просто метод, разница в том, что его имя пишется с большой буквы, " +
                "и вызывается он через new <ИмяКласса>(...), то есть это то же самое, как если сделать метод с " +
                "таким же названием, с большой буквы, только чуть короче.");

    }
}
