// видеоурок прервался на мин 22 40
package task2_2_1_3;

public class Task2_2_1_3 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 2. Тема 2. Урок 1. Многопоточность, Thread.
                    Задание 3. Создать экземпляр класса и запустить новый поток.

                Решение:\s""");

    }
}
