package task2_2_4_1;

public class Task2_2_4_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 2. Тема 2. Урок 4. Многопоточность. Семофоры.
                    Задание 1. Расскажите своими словами, что такое семафоры в контексте
                    многопоточности в JAVA?

                Решение:\s""");

        System.out.println("Синхронизация делает возможным взаимодействие разных " +
                "потоков путем совместного доступа ..............................");
    }
}
