public class Draft_Task2_1_2_1_LyambdaVyrazheniya_FunktcionalnyeInterfeisy {
    public static void main(String[] args) {
        System.out.println("""
                Задание для Урока 2. Лямбда-выражения, функциональные интерфейсы:\s
                1. Написать лямбда выражение, которое принимает на вход число и возвращает
                   значение “Положительное число”, “Отрицательное число” или “Ноль”. Используем
                   функциональный интерфейс Function.

                Решение:\s""");

    }
}
